#ifndef MEX_H_FIGHTER
#define MEX_H_FIGHTER

#include "structs.h"
#include "datatypes.h"
#include "obj.h"
#include "gx.h"
#include "color.h"
#include "effects.h"
#include "match.h"
#include "collision.h"
#include "dynamics.h"

typedef enum FighterKind
{
    FTKIND_MARIO,
    FTKIND_FOX,
    FTKIND_FALCON,
    FTKIND_DK,
    FTKIND_KIRBY,
    FTKIND_BOWSER,
    FTKIND_LINK,
    FTKIND_SHEIK,
    FTKIND_NESS,
    FTKIND_PEACH,
    FTKIND_POPO,
    FTKIND_NANA,
    FTKIND_PIKACHU,
    FTKIND_SAMUS,
    FTKIND_YOSHI,
    FTKIND_JIGGLYPUFF,
    FTKIND_MEWTWO,
    FTKIND_LUIGI,
    FTKIND_MARTH,
    FTKIND_ZELDA,
    FTKIND_YOUNGLINK,
    FTKIND_DRMARIO,
    FTKIND_FALCO,
    FTKIND_PICHU,
    FTKIND_GAW,
    FTKIND_GANONDORF,
    FTKIND_ROY,
    FTKIND_MASTERHAND,
    FTKIND_CRAZYHAND,
    FTKIND_BOY,
    FTKIND_GIRL,
    FTKIND_GIGABOWSER,
    FTKIND_SANDBAG,
} FighterKind;
typedef enum CharacterKind
{
    CKIND_FALCON,
    CKIND_DK,
    CKIND_FOX,
    CKIND_GAW,
    CKIND_KIRBY,
    CKIND_BOWSER,
    CKIND_LINK,
    CKIND_LUIGI,
    CKIND_MARIO,
    CKIND_MARTH,
    CKIND_MEWTWO,
    CKIND_NESS,
    CKIND_PEACH,
    CKIND_PIKACHU,
    CKIND_ICECLIMBERS,
    CKIND_JIGGLYPUFF,
    CKIND_SAMUS,
    CKIND_YOSHI,
    CKIND_ZELDA,
    CKIND_SHEIK,
    CKIND_FALCO,
    CKIND_YOUNGLINK,
    CKIND_DRMARIO,
    CKIND_ROY,
    CKIND_PICHU,
    CKIND_GANONDORF,
    CKIND_MASTERHAND,
    CKIND_BOY,
    CKIND_GIRL,
    CKIND_GIGABOWSER,
    CKIND_CRAZYHAND,
    CKIND_SANDBAG,
    CKIND_POPO,

#define ASID_ACTIONABLEGROUND 1001
#define ASID_ACTIONABLEAIR 1002
#define ASID_DAMAGEAIR 1003
#define ASID_JUMPS 1004
#define ASID_FALLS 1005

typedef enum Ft_AttackKind
{
    ATKKIND_0,
    ATKKIND_NONE,
    ATKKIND_JAB1,
    ATKKIND_JAB2,
    ATKKIND_JAB3,
    ATKKIND_JAB4,
    ATKKIND_DASH,
    ATKKIND_FTILT,
    ATKKIND_UTILT,
    ATKKIND_DTILT,
    ATKKIND_FSMASH,
    ATKKIND_USMASH,
    ATKKIND_DSMASH,
    ATKKIND_NAIR,
    ATKKIND_FAIR,
    ATKKIND_BAIR,
    ATKKIND_UAIR,
    ATKKIND_DAIR,
    ATKKIND_SPECIALN,
    ATKKIND_SPECIALS,
    ATKKIND_SPECIALHI,
    ATKKIND_SPECIALLW,
    ATKKIND_22,
    ATKKIND_23,
    ATKKIND_24,
    ATKKIND_25,
    ATKKIND_26,
    ATKKIND_27,
    ATKKIND_28,
    ATKKIND_29,
    ATKKIND_30,
    ATKKIND_31,
    ATKKIND_32,
    ATKKIND_33,
    ATKKIND_34,
    ATKKIND_35,
    ATKKIND_36,
    ATKKIND_37,
    ATKKIND_38,
    ATKKIND_39,
    ATKKIND_40,
    ATKKIND_41,
    ATKKIND_42,
    ATKKIND_43,
    ATKKIND_44,
    ATKKIND_45,
    ATKKIND_46,
    ATKKIND_47,
    ATKKIND_48,
    ATKKIND_49,
    ATKKIND_DOWNATTACKU,
    ATKKIND_DOWNATTACKD,
    ATKKIND_PUMMEL,
    ATKKIND_FTHROW,
    ATKKIND_BTHROW,
    ATKKIND_UPTHROW,
    ATKKIND_DTHROW,
    ATKKIND_57,
    ATKKIND_58,
    ATKKIND_59,
    ATKKIND_60,
    ATKKIND_61,
    ATKKIND_62,
    ATKKIND_63,
    ATKKIND_64,
    ATKKIND_65,
    ATKKIND_66,
    ATKKIND_67,
    ATKKIND_68,
    ATKKIND_69,
    ATKKIND_70,
    ATKKIND_71,
    ATKKIND_72,
    ATKKIND_73,
    ATKKIND_74,
    ATKKIND_75,
    ATKKIND_76,
    ATKKIND_77,
    ATKKIND_78,
    ATKKIND_79,
    ATKKIND_80,
    ATKKIND_81,
    ATKKIND_82,
    ATKKIND_83,
    ATKKIND_84,
    ATKKIND_85,
    ATKKIND_86,
    ATKKIND_87,
} Ft_AttackKind;
typedef enum FtStateKind
{
    FTSTATEKIND_FREE,        // generally actionable states, like wait, run, jump
    FTSTATEKIND_DEFENSE,     // shield, roll, airdodge
    FTSTATEKIND_ATTACK,      // common attacks like jabs, tilts, and ledge attacks
    FTSTATEKIND_SPECIAL,     // any special state
    FTSTATEKIND_4,           //
    FTSTATEKIND_DAMAGE,      // damage states, including, mewtwo confuse, shield break,
    FTSTATEKIND_DOWNED,      // downed animations, incuding downbound, downback/forward, downattack,
    FTSTATEKIND_PASSIVE,     // tech animations, such as in place, left, right, walltech, and ceiling tech
    FTSTATEKIND_REFLECTWALL, // but also passing through a platform??
    FTSTATEKIND_LEDGE,       //
    FTSTATEKIND_CATCH,       // any grab/throw related state, like catch, catchdash, catchwait, throwf
    FTSTATEKIND_CAPTURE,     // any state related to being grabbed, like capture, thrown, etc
    FTSTATEKIND_12,          // entry animation, respawn animation, damagesong, bury
    FTSTATEKIND_DEAD,        // dead states, including star and screen ko
} FtStateKind;
typedef enum FtHurtKind
{
    FTHURTKIND_VULN,       // vulnerable
    FTHURTKIND_INTANGIBLE, // cannot be hit
    FTHURTKIND_INVINCIBLE, // can be hit, does not take damage
} FtHurtKind;

/*** Structs ***/
struct Playerblock
{
    int state;           // 0x00 = not present, 0x02 = HMN, 0x03 = CPU
    int c_kind;          // external ID
    int p_kind;          // (0x00 is HMN, 0x01 is CPU, 0x02 is Demo, 0x03 n/a)
    u8 isTransformed[2]; // 0xC, 1 indicates the fighter that is active
    Vec3 tagPos;         // 0x10
    Vec3 spawnPos;       // 0x1C
    Vec3 respawnPos;     // 0x28
    int x34;
    int x38;
    int x3C;
    float initialFacing; // 0x40
    u8 costume;          // 0x44
    u8 color_accent;     // 0x45, will correspond to port color when ffa and team color when teams
    u8 tint;             // 0x46
    u8 team;             // 0x47
    u8 controller;       // 0x48
    u8 cpuLv;            // 0x49
    u8 cpuKind;          // 0x4a
    u8 handicap;         // 0x4b
    u8 x4c;              // 0x4c
    u8 kirby_copy;       // 0x4d, index of kirby copy ability
    u8 x4e;              // 0x4e
    u8 x4f;              // 0x4f
    float attack;        // 0x50
    float defense;       // 0x54
    float scale;         // 0x58
    u16 damage;          // 0x5c
    u16 initialDamage;   // 0x5e
    u16 stamina;         // 0x60
    int falls[2];        // 0x68
    int ko[6];           // 0x70
    int x88;
    u16 selfDestructs;
    u8 stocks;
    int coins_curr;
    int coins_total;
    int x98;
    int x9c;
    int stickSmashes[2];
    int tag;
    int xa8;              // 0xa8
    u8 xac_80 : 1;        // 0xac, 0x80
    u8 is_multispawn : 1; // 0xac, 0x40
    u8 xac_3f : 6;        // 0xac, 0x3f
    u8 xad;               // 0xad
    u8 xae;               // 0xae
    u8 xaf;               // 0xaf
    GOBJ *gobj[2];        // 0xb0
    void *cb_subft_init;  // 0xb8, function executed on subfighter after creating them @ 80031c84
    struct                // 0xbc, stale moves
    {                     //
        int cur;          // Zero-Indexed. Rolls over after 9. Increments after each write.
        s16 queue[10];    // array of attack indices
    } stale_moves;        //
    struct                // 0xE8
    {                     //
        u8 x0[0xcb4];     // 0x0
        int killer_ply;   // 0xcb8, 6 == none
        u8 xcbc[0x60];    //
        struct            // 0xd1c
        {                 //
            int running;  // 0xd1c
            int airborne; //
            int grounded; //
        } time;           //
    } stats;
};
struct PlayerData
{
    // byte 0x0
    u8 c_kind;  // 0x0
    u8 p_kind;  // 0x1
    u8 stocks;  // 0x2
    u8 costume; // 0x3
    // 0x4
    u8 portNumberOverride;
    u8 spawnPointOverride;
    u8 facingDirection;
    u8 subcolor;
    // 0x8
    u8 handicap;
    u8 team;
    u8 nametag;
    u8 xb;
    // 0xC
    unsigned char isRumble : 1;
    unsigned char isEntry : 1;
    unsigned char unk2 : 6;
    // 0xD
    unsigned char xd_80 : 1;
    unsigned char is_black_stock : 1; // 0xD, 0x40, makes the stock icon completely black
    unsigned char xd_20 : 1;
    unsigned char always_show_indicator : 1; // 0xD, 0x10, will always display player indicator (p1, p2, ally heart, etc)
    unsigned char xd_3f : 4;                 // 0xD, 0x0F
    // 0xE
    u8 cpuKind;
    // 0xF
    u8 cpuLevel;
    // 0x10
    u16 damage_spawn;
    u16 damage_respawn; // 0x12
    u16 stamina_spawn;  // 0x14
    float attack;       // 0x18
    float defense;      // 0x1C
    float scale;        // 0x20
};

struct FtCreateDesc //
{
    int ft_kind;  // 0x0
    u8 ply;       // 0x4
    u8 x5;        // 0x5
    u8 ms;        // 0x6
    int x8;       // 0x8
    u8 xc_80 : 1; // 0xc
    u8 xc_40 : 1; // 0xc
};

struct FighterBone
{
    JOBJ *joint;          // 0x0
    JOBJ *joint2;         // 0x4, used for interpolation
    int is_dynamic : 1;   // 0x8, 0x80
    int is_active : 1;    // 0x8, 0x40
    int x8_20 : 1;        // 0x8, 0x20, related to it being a runtime bone? is checked at 8006f544
    int is_unk : 1;       // 0x8, 0x10, function 80074ee8 sets this flag on TransN, XRotN, YRotN, ThrowN
    int is_unk_2 : 1;     // 0x8, 0x08, function 80074ee8 sets this flag on TransN, Extra
    int no_anim : 1;      // 0x8, 0x04, will not animate the bone when set
    int x8_03FFFFFF : 26; // 0x8, unk
    int depth : 8;        // 0xC, 0xFF000000, number of parents to get to root
    int dobj_start : 7;   // 0xC, 0x00FE0000, first dobj belonging to this joint. (most every dobj belongs to joint 0, so this is usually equal to the total number of dobjs for subsequent joints)
    int xC_0001 : 1;      // 0xC, 0x00010000
    int xC_0000FFFF : 16; // 0xC, 0x0000FFFF, unk
};

struct DynamicsDesc
{
    int root_bone; // bone index;
    void *params;  // dynamics params;
    int num;       // number of children bones to make dynamic
    float xc;
    float x10;
    float x14;
};

struct DynamicsHitDesc
{
    int bone; // bone index
    int x4;   // unk
    Vec3 x8;  // unk
};

struct DynamicsBehave
{
    int num; // number of dynamic bones to animate in the boneset
};

struct IKParam
{
    u8 legr_index;    // 0x0
    u8 legl_index;    // 0x1
    float leg_param;  // 0x4
    u8 kneer_index;   // 0x8
    u8 kneel_index;   // 0x9
    float knee_param; // 0xC
    u8 footr_index;   // 0x10
    u8 footl_index;   // 0x11
    float foot_param1;
    float foot_param2;
    u8 shoulderr_index;
    u8 shoulderl_index;
    float shoulder_param;
    u8 armr_index;
    u8 arml_index;
    float arm_param1;
    float arm_param2;
};

struct FtVis
{
    s8 prev_value; // value before changed, used to restore original visibility
    s8 index;      // displays the index's dobjs. -1 = hides all dobjs in this table

    /*
    Fighter Visibility Update @ 80074b6c
    - Clears hidden flag on all dobjs in the tables
    - Sets hidden flag on all dobjs in all non-current tables
    */
};

struct FtDynamicBoneset
{
    int apply_anim_num;     // if this is 256, dyanmics are not processed
    DynamicBoneset boneset; // 0x4
};

struct FtSFXArr
{
    int num;
    int *sfx_ids;
};

struct FtSFX
{
    FtSFXArr *smash;     // 0x0
    int death;           // 0x4
    int metal_box;       // 0x8
    int star_ko;         // 0xc
    int jump;            // 0x10
    int jump_air;        // 0x14
    int escape;          // 0x18
    FtSFXArr *light_hit; // 0x1c
    FtSFXArr *heavy_hit; // 0x20
    int tech;            // 0x24
    int cliffcatch;      // 0x28
    int heavy_lift;      // 0x2c
    int item_catch;      // 0x30
    int cheer;           // 0x34
};

struct FtCollDesc
{
    u16 ecb_bone_top;         // 0x0
    u16 ecb_bone_arm_left;    // 0x2
    u16 ecb_bone_arm_right;   // 0x4
    u16 ecb_bone_leg_left;    // 0x6
    u16 ecb_bone_leg_right;   // 0x8
    u16 ecb_bone_center;      // 0xA
    float ecb_size_mult;      // 0xC
    float cliffgrab_width;    // 0x10
    float cliffgrab_y_offset; // 0x14
    float cliffgrab_height;   // 0x18
};

struct ftData
{
    int *common_attr;   // 0x0
    int *ext_attr;      // 0x4
    u8 *modelLookup;    // 0x8
    FtAction *ftaction; // 0xC
    int animDynamics;   // 0x10
    int x14;
    int x18;
    int x1C;
    int x20;
    int x24;
    int x28;
    ftDynamics *dynamics; // 0x2C
    int hurtbox;          // 0x30
    int *center_bubble;   // 0x34
    int x38;
    int x3C;
    int x40;
    FtCollDesc *coll;
    ItemDesc **items;
    FtSFX *sfx;
    int x50;
    int x54;
    IKParam *ik_param;
};

struct ftChkDevice // 80459a68
{
    int x0;
    int x4;
    int x8;
    int xc;
    int x10;
    int x14;
    int x18;
    int x1c;
    int x20;
    GOBJ *gobj;
    int hazard_kind;
    void *check;
};

struct FtState
{
    int action_id;
    int flags;
    char move_id;
    char bitflags1;
    void *animation_callback;
    void *iasa_callback;
    void *physics_callback;
    void *collision_callback;
    void *camera_callback;
};

struct FtAction
{
    char *anim_symbol; // ptr to the symbol name for this animation
    int anim_offset;   // offset of the anim data in plxxaj
    int anim_size;     // size of the animation data
    void *script;      // pointer to the script data for this action
    int flags;         //
    void *anim_data;   // pointer to the animation data in ARAM
};

struct Figatree // this is the data contained in PlyX5K_Share_ACTION_X_figatree.dat (which is stored in the AJ file in ARAM, confusing i know)
{
    int kind;        // 0x0
    int x4;          // 0x4
    float frame_num; // 0x8, total number of frames in this animation
    void *nodes;     // 0xC
    void *tracks;    // 0x10
};

struct ReflectDesc
{
    int bone;
    int max_damage;
    Vec3 pos;
    float radius;
    float damage_mult;
    float velocity_mult;
    int flags;
};

struct ShieldDesc
{
    int bone;
    int max_damage;
    Vec3 pos;
    float radius;
    float damage_mult;
    float velocity_mult;
    int flags;
};

struct AbsorbDesc
{
    int bone;     // x00
    Vec3 pos;     // x04
    float radius; // x10
};

struct AfterImageDesc
{
    float x0;            // 0x0
    float x4;            // 0x4
    u8 start_alpha;      // 0x8
    u8 end_alpha;        // 0x8
    u8 in_col[4];        // 0xA
    u8 out_col[4];       // 0xE
    u8 x12;              // 0x12
    u8 x13;              // 0x13
    int bone_index;      // 0x14
    float offset_bottom; // 0x18
    float offset_top;    // 0x1C
};
struct FtDmgLog
{
    float direction;     // 0x1844, 0x0
    int kb_angle;        // 0x1848, 0x4
    int hurt_kind;       // 0x184c, 0x8. 0 = low, 1 = mid, 2 = hi (previously was called damaged_hurtbox)
    float force_applied; // 0x1850, 0xc, to get kb magnitude, multiply by 0.03
    Vec3 collpos;        // 0x1854, 0x10
    int attribute;       // 0x1860, 0x1c
    int x1864;           // 0x1864, 0x20
    GOBJ *source;        // 0x1868, 0x24
    float percent;       // 0x186c, 0x28
};

struct HitVictim
{
    void *data; // userdata of the object that was hit
    int timer;  // items use this to wait until hitting this gobj again
};

struct ftHit
{
    int active;                   // 0x0
    int x4;                       // 0x4
    int dmg;                      // 0x8
    float dmg_f;                  // 0xc
    Vec3 offset;                  // 0x10
    float size;                   // 0x1c
    int angle;                    // 0x20
    int kb_growth;                // 0x24
    int wdsk;                     // 0x28
    int kb;                       // 0x2c
    int attribute;                // 0x30
    int shield_dmg;               // 0x34
    int hitsound_severity;        // 0x38. hurtbox interaction. 0 = none, 1 = grounded, 2 = aerial, 3 = both
    int hitsound_kind;            // 0x3c
    char x40;                     // 0x40
    char x41;                     // 0x41
    unsigned char x421 : 1;       // 0x42 0x80
    unsigned char x422 : 1;       // 0x42 0x40
    unsigned char x423 : 1;       // 0x42 0x20
    unsigned char x424 : 1;       // 0x42 0x10
    unsigned char no_hurt : 1;    // 0x42 0x08      ignore hurtbox
    unsigned char no_reflect : 1; // 0x42 0x04      ignore reflect?
    unsigned char x427 : 1;       // 0x42 0x02
    unsigned char x428 : 1;       // 0x42 0x01
    unsigned char x431 : 1;       // 0x43 0x80
    unsigned char x432 : 1;       // 0x43 0x40
    unsigned char hit_all : 1;    // 0x43 0x20
    unsigned char x434 : 1;       // 0x43 0x10
    unsigned char x435 : 1;       // 0x43 0x08
    unsigned char x436 : 1;       // 0x43 0x04
    unsigned char x437 : 1;       // 0x43 0x02
    unsigned char x438 : 1;       // 0x43 0x01
    u8 x44;                       // 0x44
    u8 victim_num;                // 0x45
    JOBJ *bone;                   // 0x48
    Vec3 pos;                     // 0x4c
    Vec3 pos_prev;                // 0x58
    Vec3 pos_coll;                // 0x64   position of hurt collision
    float coll_distance;          // 0x70   Distance From Collding FtHurt (Used for phantom hit collision calculation)
    HitVictim victims[24];        // 0x74
    int x134;                     // 0x134, flags of some sort
};

struct FtHurt
{
    int state;                    // 0x0, whether or not this hurtbox can be hit
    Vec3 hurt1_offset;            // 0x4
    Vec3 hurt2_offset;            // 0x10
    float scale;                  // 0x1c
    JOBJ *jobj;                   // 0x20
    unsigned char is_updated : 1; // 0x24, if enabled, wont update position
    unsigned char x24_2 : 1;      // 0x24 0x40
    unsigned char x24_3 : 1;      // 0x24 0x20
    unsigned char x24_4 : 1;      // 0x24 0x10
    unsigned char x24_5 : 1;      // 0x24 0x08
    unsigned char x24_6 : 1;      // 0x24 0x04
    unsigned char x24_7 : 1;      // 0x24 0x02
    unsigned char x24_8 : 1;      // 0x24 0x01
    Vec3 hurt1_pos;               // 0x28
    Vec3 hurt2_pos;               // 0x34
    int bone_index;               // 0x40
    int hurt_kind;                // 0x44. 0 = low, 1 = mid, 2 = high
    int is_grabbable;             // 0x48
};

struct FtCoin
{
    float size;    // 0x0
    JOBJ *jobj;    // 0x4
    Vec3 pos_cur;  // 0x8
    Vec3 pos_prev; // 0x14
    Vec3 coll_pos; // 0x20
};

struct FtAfterImageKey
{
    Vec3 pos;
    Vec3 rot;
};

struct CPULeaderLog
{
    int x0;                 // 0x0, 0xfc
    u8 x4;                  // 0x4, 0x100
    u8 x5;                  // 0x3, 0x101
    u8 x6;                  // 0x6, 0x102
    u8 x7;                  // 0x7, 0x103
    int x8;                 // 0x8, 0x104
    Vec3 pos;               // 0xc, 0x108
    float facing_direction; // 0x18, 0x114
};

struct CPU
{
    int held;                    // 0x0
    s8 lstickX;                  // 0x4
    s8 lstickY;                  // 0x5
    s8 cstickX;                  // 0x6
    s8 cstickY;                  // 0x7
    s8 ltrigger;                 // 0x8
    s8 rtrigger;                 // 0x9
    int ai;                      // 0xc, 25 of these, function table at 800a1090
    int level;                   // 0x10
    int x14;                     // 0x14
    int scenario_id;             // 0x18
    int default_scenario_id;     // 0x1c
    int alt_scenario_id;         // 0x20
    int x24;                     // 0x24
    int x28;                     // 0x28
    int x2c;                     // 0x2c
    int x30;                     // 0x30
    int x34;                     // 0x34
    float x38;                   // 0x38
    float x3c;                   // 0x3c
    float x40;                   // 0x40
    FighterData *target_fighter; // 0x44
    void *x48;                   // 0x48
    float x4c;                   // 0x4c
    ItemData *target_item;       // 0x50
    Vec2 target_pos;             // 0x54
    float target_distance;       // 0x5c
    int x60;                     // 0x60
    float ground_x;              // 0x64
    float ground_y;              // 0x68
    float atk_range_front;       // 0x6c
    float atk_range_top;         // 0x70
    float atk_range_back;        // 0x74
    float atk_range_bottom;      // 0x78
    int cpu_frame;               // 0x7c, number of times it updated CPU logic in any capacity
    int senario_timer;           // 0x80, number of times it tried to update CPU scenario
    int x84;                     // 0x84
    int x88;                     // 0x88
    int x8c;                     // 0x8c
    int x90;                     // 0x90
    int num_of_pummels;          // 0x94
    Vec3 x98;                    // 0x98
    int pending_plco_command;    // 0xa4
    int xa8;                     // 0xa8
    int xac;                     // 0xac
    int xb0;                     // 0xb0
    int xb4;                     // 0xb4
    int xb8;                     // 0xb8
    int xbc;                     // 0xbc
    int xc0;                     // 0xc0
    int xc4;                     // 0xc4
    u8 xc8;                      // 0xc8
    int xcc;                     // 0xcc
    int xd0;                     // 0xd0CPULeaderLog
    int xd4;                     // 0xd4
    int xd8;                     // 0xd8
    int xdc;                     // 0xdc
    int xe0;                     // 0xe0
    int xe4;                     // 0xe4
    int xe8;                     // 0xe8
    u8 xec;                      // 0xec
    int xf0;                     // 0xf0
    int xf4;                     // 0xf4
    u8 xf8;                      // xf8 flags
    u8 xf9;                      // xf9 flags
    u8 xfa;                      // xfa flags 0x01 is the "isCopy" flag (uses leaders inputs)
    u8 xfb;                      // xfb flags
    CPULeaderLog leader_log[30]; // 0xfc, contains a log of per frame data about the followers leader
    CPULeaderLog *curr_unk;      // 0x444
    CPULeaderLog *curr_unk2;     // 0x448, cpu scenario not updated if this contains a pointer @ 800b27b8
    int cmd_wait;                // 0x44c, cpu scenario not updated if this contains a pointer @ 800b27c4
    void *csP;                   // 0x450
    u8 cmdscript_queue[256];     // 0x454, list of command ids for the follower to execute
    void *cmdscript_curr;        // 0x554, points to a command in the cmdscript queue
    float x558;                  // 0x558
    float detect_back;           // 0x55C
    float detect_front;          // 0x560
    float detect_center;         // 0x564
    float detect_height;         // 0x568
    float x56c;                  // 0x56C
    Vec3 x570;                   // 0x570
};

struct FtDmgVibrateDesc
{
    Vec2 *offsets;
    int num;
};

struct ftCommonBone
{
    u8 *x0;
    u8 *x4;
    int bone_num;
};

struct ftCommonData
{
    float x0;                                  // 0x0
    float x4;                                  // 0x4
    float x8;                                  // 0x8
    float xc;                                  // 0xc
    float x10;                                 // 0x10
    float x14;                                 // 0x14
    float x18;                                 // 0x18
    int meteor_lockout;                        // 0x1c
    float lstick_tilt;                         // 0x20
    float x24;                                 // 0x24
    float walk_anim_mid_percentage;            // 0x28
    float walk_anim_fast_percentage;           // 0x2c
    float x30;                                 // 0x30
    float x34;                                 // 0x34
    float x38;                                 // 0x38
    float dash_min_stick;                      // 0x3c
    int dash_min_stick_tilt;                   // 0x40
    float x44;                                 // 0x44
    float x48;                                 // 0x48
    float x4c;                                 // 0x4c
    float x50;                                 // 0x50
    float x54;                                 // 0x54
    float x58;                                 // 0x58
    float x5c;                                 // 0x5c
    float x60;                                 // 0x60
    float x64;                                 // 0x64
    float x68;                                 // 0x68
    float friction_mult;                       // 0x6c
    float jumpaerial_lsticky;                  // 0x70
    int jumpaerial_lsticktimer;                // 0x74
    float x78;                                 // 0x78
    float x7c;                                 // 0x7c
    float x80;                                 // 0x80
    float x84;                                 // 0x84
    float x88;                                 // 0x88
    float x8c;                                 // 0x8c
    float lstick_rebirthfall;                  // 0x90
    float x94;                                 // 0x94
    float x98;                                 // 0x98
    float x9c;                                 // 0x9c
    float xa0;                                 // 0xa0
    float xa4;                                 // 0xa4
    float xa8;                                 // 0xa8
    float xac;                                 // 0xac
    float xb0;                                 // 0xb0
    float xb4;                                 // 0xb4
    float xb8;                                 // 0xb8
    float xbc;                                 // 0xbc
    float xc0;                                 // 0xc0
    float xc4;                                 // 0xc4
    float xc8;                                 // 0xc8
    float xcc;                                 // 0xcc
    float xd0;                                 // 0xd0
    float xd4;                                 // 0xd4
    float xd8;                                 // 0xd8
    float xdc;                                 // 0xdc
    float xe0;                                 // 0xe0
    float xe4;                                 // 0xe4
    float xe8;                                 // 0xe8
    float xec;                                 // 0xec
    float xf0;                                 // 0xf0
    float xf4;                                 // 0xf4
    float xf8;                                 // 0xf8
    float xfc;                                 // 0xfc
    float force_applied_to_kb_mag_multiplier;  // 0x100, multiplied with force_applied to get the knockback vector's magnitude
    float armor_min;                           // 0x104, kb reduction via armor cant go below this value
    float x108;                                // 0x108
    float x10c;                                // 0x10c
    float x110;                                // 0x110
    float x114;                                // 0x114
    float x118;                                // 0x118
    float x11c;                                // 0x11c
    float x120;                                // 0x120
    float kb_reduction_crouch;                 // 0x124
    float x128;                                // 0x128
    float x12c;                                // 0x12c
    float x130;                                // 0x130
    float x134;                                // 0x134
    float x138;                                // 0x138
    float x13c;                                // 0x13c
    float x140;                                // 0x140
    float kb_sakurai_angle_aerial;             // 0x144, sakurai angle becomes this angle when the victim is airborne, in degrees
    float kb_sakurai_angle_grounded;           // 0x148, sakurai angle becomes this angle when the victim is grounded, in degrees
    float kb_grounded_sakurai_angle_threshold; // 0x14c, when knockback force is less than this and victim is grounded, it uses angle 0, in degrees
    float x150;                                // 0x150,
    float x154;                                // 0x154
    float x158;                                // 0x158
    float x15c;                                // 0x15c
    float x160;                                // 0x160
    float kb_maxVelX;                          // 0x164
    float hitlag_mult;                         // 0x168
    float hitlag_base;                         // 0x16c, is 0 in vanilla
    float x170;                                // 0x170
    float x174;                                // 0x174
    float x178;                                // 0x178
    float x17c;                                // 0x17c
    float x180;                                // 0x180
    float x184;                                // 0x184
    float x188;                                // 0x188
    float x18c;                                // 0x18c
    float x190;                                // 0x190
    float hitlag_max;                          // 0x194
    float x198;                                // 0x198
    float x19c;                                // 0x19c
    float x1a0;                                // 0x1a0
    float hitlag_elec;                         // 0x1a4
    float tdi_maxAngle;                        // 0x1a8
    float x1ac;                                // 0x1ac
    float x1b0;                                // 0x1b0
    float x1b4;                                // 0x1b4
    float x1b8;                                // 0x1b8
    float kb_bounceDecay;                      // 0x1bc
    float x1c0;                                // 0x1c0
    float x1c4;                                // 0x1c4
    float x1c8;                                // 0x1c8
    float x1cc;                                // 0x1cc
    float x1d0;                                // 0x1d0
    float x1d4;                                // 0x1d4
    float x1d8;                                // 0x1d8
    float x1dc;                                // 0x1dc
    float x1e0;                                // 0x1e0
    float x1e4;                                // 0x1e4
    float x1e8;                                // 0x1e8
    float x1ec;                                // 0x1ec
    float x1f0;                                // 0x1f0
    float x1f4;                                // 0x1f4
    float x1f8;                                // 0x1f8
    float x1fc;                                // 0x1fc
    float x200;                                // 0x200
    float kb_frameDecay;                       // 0x204
    float x208;                                // 0x208
    float x20c;                                // 0x20c
    float x210;                                // 0x210
    float x214;                                // 0x214
    float x218;                                // 0x218
    float x21c;                                // 0x21c
    float x220;                                // 0x220
    float x224;                                // 0x224
    float x228;                                // 0x228
    float x22c;                                // 0x22c
    float x230;                                // 0x230
    float x234;                                // 0x234
    float x238;                                // 0x238
    float x23c;                                // 0x23c
    float x240;                                // 0x240
    float x244;                                // 0x244
    float x248;                                // 0x248
    float x24c;                                // 0x24c
    float x250;                                // 0x250
    float x254;                                // 0x254
    float x258;                                // 0x258
    float x25c;                                // 0x25c
    float x260;                                // 0x260
    float x264;                                // 0x264
    float x268;                                // 0x268
    float x26c;                                // 0x26c
    float x270;                                // 0x270
    float x274;                                // 0x274
    float x278;                                // 0x278
    float x27c;                                // 0x27c
    float x280;                                // 0x280
    float x284;                                // 0x284
    float x288;                                // 0x288
    float x28c;                                // 0x28c
    float x290;                                // 0x290
    float x294;                                // 0x294
    float x298;                                // 0x298
    float x29c;                                // 0x29c
    float x2a0;                                // 0x2a0
    float x2a4;                                // 0x2a4
    float x2a8;                                // 0x2a8
    float x2ac;                                // 0x2ac
    float x2b0;                                // 0x2b0
    float x2b4;                                // 0x2b4
    float x2b8;                                // 0x2b8
    float x2bc;                                // 0x2bc
    float x2c0;                                // 0x2c0
    float x2c4;                                // 0x2c4
    float x2c8;                                // 0x2c8
    float x2cc;                                // 0x2cc
    float x2d0;                                // 0x2d0
    float x2d4;                                // 0x2d4
    float x2d8;                                // 0x2d8
    float x2dc;                                // 0x2dc
    float x2e0;                                // 0x2e0
    float x2e4;                                // 0x2e4
    float x2e8;                                // 0x2e8
    float x2ec;                                // 0x2ec
    float x2f0;                                // 0x2f0
    float x2f4;                                // 0x2f4
    float x2f8;                                // 0x2f8
    float x2fc;                                // 0x2fc
    float x300;                                // 0x300
    float x304;                                // 0x304
    float x308;                                // 0x308
    float x30c;                                // 0x30c
    float x310;                                // 0x310
    float x314;                                // 0x314
    float x318;                                // 0x318
    float x31c;                                // 0x31c
    float x320;                                // 0x320
    float x324;                                // 0x324
    float x328;                                // 0x328
    float x32c;                                // 0x32c
    float x330;                                // 0x330
    float x334;                                // 0x334
    float escapeair_vel;                       // 0x338
    float escapeair_veldecaymult;              // 0x33c
    float x340;                                // 0x340
    float x344;                                // 0x344
    float x348;                                // 0x348
    float x34c;                                // 0x34c
    float x350;                                // 0x350
    float grab_mash_min;                       // 0x354
    float grab_mash_per_handicap;              // 0x358
    float grab_max_handicap;                   // 0x35c
    float grab_placing_mult;                   // 0x360
    float grab_placing_max;                    // 0x364
    float grab_mash_mult;                      // 0x368
    float x36c;                                // 0x36c
    float x370;                                // 0x370
    float x374;                                // 0x374
    float x378;                                // 0x378
    float x37c;                                // 0x37c
    float x380;                                // 0x380
    float x384;                                // 0x384
    float x388;                                // 0x388
    float x38c;                                // 0x38c
    float x390;                                // 0x390
    float x394;                                // 0x394
    float x398;                                // 0x398
    float x39c;                                // 0x39c
    float x3a0;                                // 0x3a0
    float grab_mash_per_frame;                 // 0x3a4
    float grab_mash_per_input;                 // 0x3a8
    float x3ac;                                // 0x3ac
    float grab_wiggle_per_input;               // 0x3b0
    float grab_wiggle_rate;                    // 0x3b4
    float x3b8;                                // 0x3b8
    float x3bc;                                // 0x3bc
    float x3c0;                                // 0x3c0
    float x3c4;                                // 0x3c4
    float x3c8;                                // 0x3c8
    float x3cc;                                // 0x3cc
    float x3d0;                                // 0x3d0
    float x3d4;                                // 0x3d4
    float x3d8;                                // 0x3d8
    float x3dc;                                // 0x3dc
    float x3e0;                                // 0x3e0
    float x3e4;                                // 0x3e4
    float x3e8;                                // 0x3e8
    float x3ec;                                // 0x3ec
    float x3f0;                                // 0x3f0
    float x3f4;                                // 0x3f4
    float x3f8;                                // 0x3f8
    float x3fc;                                // 0x3fc
    float x400;                                // 0x400
    float x404;                                // 0x404
    float x408;                                // 0x408
    float x40c;                                // 0x40c
    float x410;                                // 0x410
    float x414;                                // 0x414
    float x418;                                // 0x418
    float x41c;                                // 0x41c
    float x420;                                // 0x420
    float x424;                                // 0x424
    float x428;                                // 0x428
    float x42c;                                // 0x42c
    float x430;                                // 0x430
    float x434;                                // 0x434
    float x438;                                // 0x438
    float x43c;                                // 0x43c
    float x440;                                // 0x440
    float x444;                                // 0x444
    float x448;                                // 0x448
    float x44c;                                // 0x44c
    float x450;                                // 0x450
    float zjostle_frame;                       // 0x45c
    float zjostle_max;                         // 0x460
    float ms_zjostle_frame;                    // 0x45c
    float ms_zjostle_max;                      // 0x460
    float x464;                                // 0x464
    float x468;                                // 0x468
    float x46c;                                // 0x46c
    float x470;                                // 0x470
    float x474;                                // 0x474
    float x478;                                // 0x478
    float x47c;                                // 0x47c
    float x480;                                // 0x480
    float x484;                                // 0x484
    float x488;                                // 0x488
    float x48c;                                // 0x48c
    float x490;                                // 0x490
    float x494;                                // 0x494
    float x498;                                // 0x498
    int cliff_invuln_time;                     // 0x49c
    float x4a0;                                // 0x4a0
    float x4a4;                                // 0x4a4
    float x4a8;                                // 0x4a8
    float x4ac;                                // 0x4ac
    float asdi_mag;                            // 0x4b0
    float x4b4;                                // 0x4b4
    float x4b8;                                // 0x4b8
    float asdi_units;                          // 0x4bc
    float x4c0;                                // 0x4c0
    float x4c4;                                // 0x4c4
    float x4c8;                                // 0x4c8
    float x4cc;                                // 0x4cc
    float x4d0;                                // 0x4d0
    float x4d4;                                // 0x4d4
    float x4d8;                                // 0x4d8
    float x4dc;                                // 0x4dc
    float x4e0;                                // 0x4e0
    float x4e4;                                // 0x4e4
    float x4e8;                                // 0x4e8
    float x4ec;                                // 0x4ec
    float x4f0;                                // 0x4f0
    float x4f4;                                // 0x4f4
    float x4f8;                                // 0x4f8
    float x4fc;                                // 0x4fc
    int dead_timer;                            // 0x500
    float x504;                                // 0x504
    float x508;                                // 0x508
    float x50c;                                // 0x50c
    float x510;                                // 0x510
    float x514;                                // 0x514
    float x518;                                // 0x518
    float x51c;                                // 0x51c
    float x520;                                // 0x520
    float x524;                                // 0x524
    float x528;                                // 0x528
    float x52c;                                // 0x52c
    float x530;                                // 0x530
    float x534;                                // 0x534
    float x538;                                // 0x538
    float x53c;                                // 0x53c
    float x540;                                // 0x540
    float x544;                                // 0x544
    float x548;                                // 0x548
    float x54c;                                // 0x54c
    float x550;                                // 0x550
    float x554;                                // 0x554
    float x558;                                // 0x558
    float x55c;                                // 0x55c
    float x560;                                // 0x560
    float x564;                                // 0x564
    float x568;                                // 0x568
    float x56c;                                // 0x56c
    float x570;                                // 0x570
    float x574;                                // 0x574
    float x578;                                // 0x578
    float x57c;                                // 0x57c
    float x580;                                // 0x580
    float x584;                                // 0x584
    float x588;                                // 0x588
    float x58c;                                // 0x58c
    float x590;                                // 0x590
    float x594;                                // 0x594
    float x598;                                // 0x598
    float x59c;                                // 0x59c
    float x5a0;                                // 0x5a0
    float x5a4;                                // 0x5a4
    float x5a8;                                // 0x5a8
    float x5ac;                                // 0x5ac
    float x5b0;                                // 0x5b0
    float x5b4;                                // 0x5b4
    float x5b8;                                // 0x5b8
    float x5bc;                                // 0x5bc
    float x5c0;                                // 0x5c0
    float x5c4;                                // 0x5c4
    float x5c8;                                // 0x5c8
    float x5cc;                                // 0x5cc
    float x5d0;                                // 0x5d0
    float x5d4;                                // 0x5d4
    float x5d8;                                // 0x5d8
    float x5dc;                                // 0x5dc
    float x5e0;                                // 0x5e0
    float x5e4;                                // 0x5e4
    float x5e8;                                // 0x5e8
    float x5ec;                                // 0x5ec
    float x5f0;                                // 0x5f0
    float x5f4;                                // 0x5f4
    float x5f8;                                // 0x5f8
    float x5fc;                                // 0x5fc
    float x600;                                // 0x600
    float x604;                                // 0x604
    float x608;                                // 0x608
    float x60c;                                // 0x60c
    float x610;                                // 0x610
    float x614;                                // 0x614
    float x618;                                // 0x618
    float x61c;                                // 0x61c
    float x620;                                // 0x620
    float x624;                                // 0x624
    float x628;                                // 0x628
    float x62c;                                // 0x62c
    float x630;                                // 0x630
    float x634;                                // 0x634
    float x638;                                // 0x638
    float x63c;                                // 0x63c
    float x640;                                // 0x640
    float x644;                                // 0x644
    float x648;                                // 0x648
    float x64c;                                // 0x64c
    float x650;                                // 0x650
    float x654;                                // 0x654
    float x658;                                // 0x658
    float x65c;                                // 0x65c
    float x660;                                // 0x660
    float x664;                                // 0x664
    float x668;                                // 0x668
    float x66c;                                // 0x66c
    float x670;                                // 0x670
    float x674;                                // 0x674
    float x678;                                // 0x678
    float x67c;                                // 0x67c
    float x680;                                // 0x680
    float x684;                                // 0x684
    float x688;                                // 0x688
    float x68c;                                // 0x68c
    float x690;                                // 0x690
    float x694;                                // 0x694
    float x698;                                // 0x698
    float x69c;                                // 0x69c
    float x6a0;                                // 0x6a0
    float x6a4;                                // 0x6a4
    float x6a8;                                // 0x6a8
    float x6ac;                                // 0x6ac
    float x6b0;                                // 0x6b0
    float x6b4;                                // 0x6b4
    float x6b8;                                // 0x6b8
    float x6bc;                                // 0x6bc
    float x6c0;                                // 0x6c0
    float x6c4;                                // 0x6c4
    float x6c8;                                // 0x6c8
    float x6cc;                                // 0x6cc
    float x6d0;                                // 0x6d0
    float x6d4;                                // 0x6d4
    float x6d8;                                // 0x6d8
    float x6dc;                                // 0x6dc
    float x6e0;                                // 0x6e0
    float x6e4;                                // 0x6e4
    float x6e8;                                // 0x6e8
    float x6ec;                                // 0x6ec
    float unk_additional_armor;                // 0x6f0
    float x6f4;                                // 0x6f4
    float x6f8;                                // 0x6f8
    float x6fc;                                // 0x6fc
    float x700;                                // 0x700
    float x704;                                // 0x704
    float x708;                                // 0x708
    float x70c;                                // 0x70c
    float x710;                                // 0x710
    float x714;                                // 0x714
    float kb_reduction_ice;                    // 0x718
    float x71c;                                // 0x71c
    float x720;                                // 0x720
    float x724;                                // 0x724
    float x728;                                // 0x728
    float x72c;                                // 0x72c
    float x730;                                // 0x730
    float x734;                                // 0x734
    float x738;                                // 0x738
    float x73c;                                // 0x73c
    float x740;                                // 0x740
    float x744;                                // 0x744
    float x748;                                // 0x748
    float x74c;                                // 0x74c
    float x750;                                // 0x750
    float x754;                                // 0x754
    float x758;                                // 0x758
    float x75c;                                // 0x75c
    float x760;                                // 0x760
    float x764;                                // 0x764
    float x768;                                // 0x768
    float x76c;                                // 0x76c
    float x770;                                // 0x770
    float x774;                                // 0x774
    float x778;                                // 0x778
    float x77c;                                // 0x77c
    float x780;                                // 0x780
    float x784;                                // 0x784
    float x788;                                // 0x788
    float x78c;                                // 0x78c
    float x790;                                // 0x790
    float x794;                                // 0x794
    float x798;                                // 0x798
    float x79c;                                // 0x79c
    float x7a0;                                // 0x7a0
    float x7a4;                                // 0x7a4
    float tip_overlap_max;                     // 0x7a8 (phantom hit threshold)
    float x7ac;                                // 0x7ac
    float x7b0;                                // 0x7b0
    float x7b4;                                // 0x7b4
    float x7b8;                                // 0x7b8
    float x7bc;                                // 0x7bc
    float x7c0;                                // 0x7c0
    float kb_reduction_smashcharge;            // 0x7c4
    float x7c8;                                // 0x7c8
    float x7cc;                                // 0x7cc
    float x7d0;                                // 0x7d0
    float x7d4;                                // 0x7d4
    float x7d8;                                // 0x7d8
    float x7dc;                                // 0x7dc
    float x7e0;                                // 0x7e0
    float x7e4;                                // 0x7e4
    int meteor_angle_min;                      // 0x7e8
    int meteor_angle_max;                      // 0x7ec
    int meteor_delay;                          // 0x7f0, immediate delay before any action can occur
    float x7f4;                                // 0x7f4
    float x7f8;                                // 0x7f8
    float x7fc;                                // 0x7fc
    float x800;                                // 0x800
    float x804;                                // 0x804
    float x808;                                // 0x808
    float x80c;                                // 0x80c
    float x810;                                // 0x810
};

struct FighterData
{
    GOBJ *fighter;                                             // 0x0
    int kind;                                                  // 0x4
    int spawn_num;                                             // 0x8
    char ply;                                                  // 0xC
    char xd;                                                   // 0xD
    char xe;                                                   // 0xE
    char xf;                                                   // 0xF
    int state_id;                                              // 0x10
    int action_id;                                             // 0x14
    int common_state_num;                                      // 0x18
    FtState *ftstates_common;                                  // 0x1C
    FtState *ftstates_special;                                 // 0x20
    FtAction *ftaction;                                        // 0x24
    u16 *dynamics_data;                                        // 0x28
    float facing_direction;                                    // 0x2C
    float facing_direction_prev;                               // 0x30
    Vec3 scale;                                                // 0x34
    int x40;                                                   // 0x40
    Mtx temp_mtx;                                              // 0x44
    struct phys                                                // 0x74
    {                                                          //
        Vec3 anim_vel;                                         // 0x74
        Vec3 self_vel;                                         // 0x80
        Vec3 kb_vel;                                           // 0x8C
        int x98;                                               // 0x98
        int x9c;                                               // 0x9C
        int xa0;                                               // 0xA0
        int xa4;                                               // 0xA4
        int xa8;                                               // 0xA8
        int xac;                                               // 0xAC
        Vec3 pos;                                              // 0xb0
        Vec3 pos_prev;                                         // 0xBC
        Vec3 pos_delta;                                        // 0xC8
        Vec3 xD4;                                              // 0xD4
        int air_state;                                         // 0xE0
        float horzitonal_velocity_queue_will_be_added_to_0xec; // 0xE4
        float vertical_velocity_queue_will_be_added_to_0xec;   // 0xE8
        Vec3 self_vel_ground;                                  // 0xEC
        int xF8;                                               // 0xF8
        int xFC;                                               // 0xFC
        int x100;                                              // 0x100
    } phys;                                                    //
    void *x104;                                                // 0x104
    JOBJDesc *costume_jobjdesc;                                // 0x108
    ftData *ftData;                                            // 0x10C
    struct attr                                                // 0x110
    {                                                          //
        float walk_initial_velocity;                           // 0x110
        float walk_acceleration;                               // 0x114
        float walk_maximum_velocity;                           // 0x118
        float slow_walk_max;                                   // 0x11C
        float mid_walk_point;                                  // 0x120
        float fast_walk_min;                                   // 0x124
        float ground_friction;                                 // 0x128
        float dash_initial_velocity;                           // 0x12C
        float dashrun_acceleration_a;                          // 0x130
        float dashrun_acceleration_b;                          // 0x134
        float dashrun_terminal_velocity;                       // 0x138
        float run_animation_scaling;                           // 0x13C
        float max_runbrake_frames;                             // 0x140
        float grounded_max_horizontal_velocity;                // 0x144
        float jump_startup_time;                               // 0x148
        float jump_h_initial_velocity;                         // 0x14C
        float jump_v_initial_velocity;                         // 0x150
        float ground_to_air_jump_momentum_multiplier;          // 0x154
        float jump_h_max_velocity;                             // 0x158
        float hop_v_initial_velocity;                          // 0x15C
        float air_jump_v_multiplier;                           // 0x160
        float air_jump_h_multiplier;                           // 0x164
        int max_jumps;                                         // 0x168
        float gravity;                                         // 0x16C
        float terminal_velocity;                               // 0x170
        float aerial_drift_stick_mult;                         // 0x174
        float aerial_drift_base;                               // 0x178, minimum amount of drift, stick mult is added on top of this
        float aerial_drift_max;                                // 0x17C
        float aerial_friction;                                 // 0x180
        float fastfall_velocity;                               // 0x184
        float horizontal_air_mobility_constant;                // 0x188
        int jab_2_input_window;                                // 0x18C
        int jab_3_input_window;                                // 0x190
        int frames_to_change_direction_on_standing_turn;       // 0x194
        float weight;                                          // 0x198
        float model_scaling;                                   // 0x19C
        float initial_shield_size;                             // 0x1A0
        float shield_break_initial_velocity;                   // 0x1A4
        int rapid_jab_window;                                  // 0x1A8
        float rebound_frames;                                  // 0x1AC
        int x1B0;                                              // 0x1B0
        int x1B4;                                              // 0x1B4
        float ledge_jump_horizontal_velocity;                  // 0x1B8
        float ledge_jump_vertical_velocity;                    // 0x1BC
        float item_throw_velocity_multiplier;                  // 0x1C0
        float item_discard_vel_mult;                           // 0x1C4
        int x1C8;                                              // 0x1C8
        int x1CC;                                              // 0x1CC
        int x1D0;                                              // 0x1D0
        int x1D4;                                              // 0x1D4
        int x1D8;                                              // 0x1D8
        int x1DC;                                              // 0x1DC
        int x1E0;                                              // 0x1E0
        int x1E4;                                              // 0x1E4
        int x1E8;                                              // 0x1E8
        float kirby_star_scaling;                              // 0x1EC
        float kirby_b_star_damage;                             // 0x1F0
        float normal_landing_lag;                              // 0x1F4
        float n_air_landing_lag;                               // 0x1F8
        float f_air_landing_lag;                               // 0x1FC
        float b_air_landing_lag;                               // 0x200
        float u_air_landing_lag;                               // 0x204
        float d_air_landing_lag;                               // 0x208
        float nametag_height;                                  // 0x20C
        float wall_tech_x_offset;                              // 0x210
        float wall_jump_horizontal_velocity;                   // 0x214
        float wall_jump_vertical_velocity;                     // 0x218
        int x21C;                                              // 0x21C
        float trophy_scale;                                    // 0x220
        Vec3 bunny_hood_left_offset;                           // 0x224
        Vec3 bunny_hood_right_offset;                          // 0x230
        float bunny_hood_scale;                                // 0x23C
        Vec3 head_flower_offset;                               // 0x240
        float head_flower_scale;                               // 0x24C
        int x250;                                              // 0x250
        int x254;                                              // 0x254
        int unk_walljump;                                      // 0x258,
        float bubble_ratio;                                    // 0x25C
        int x260;                                              // 0x260
        int x264;                                              // 0x264
        int x268;                                              // 0x268
        int x26C;                                              // 0x26C
        float respawn_platform_scale;                          // 0x270
        int x274;                                              // 0x274
        int x278;                                              // 0x278
        int camera_zoom_target_bone;                           // 0x27C
        int x280;                                              // 0x280
        int x284;                                              // 0x284
        int x288;                                              // 0x288
        int special_jump_action___1;                           // 0x28C
        int weight_dependent_throw_speed_flags;                // 0x290
    } attr;                                                    //
    struct
    {
        Vec2 ground_light_offset; // 0x294
        Vec2 ground_light_size;   // 0x29C
        Vec2 ground_heavy_offset; // 0x2A4
        Vec2 ground_heavy_size;   // 0x2AC
        Vec2 air_light_offset;    // 0x2B4
        Vec2 air_light_size;      // 0x2BC
    } itpickup;
    float jostle_offset;                   // 0x2C4
    float jostle_range;                    // 0x2C8
    int x2CC;                              // 0x2CC
    FtMultiJumpDesc *multi_jump_desc;      // 0x2D0
    void *special_attributes;              // 0x2D4
    void *special_attributes2;             // 0x2D8
    struct                                 // 0x2DC, anim_length_lookup
    {                                      //
        float walkslow;                    // 0x2DC
        float walkmiddle;                  // 0x2E0
        float walkfast;                    // 0x2E4
        float guardon;                     // 0x2E8
        float landing;                     // 0x2EC
    } anim_length_lookup;                  //
    FtDynamicBoneset dynamics_boneset[10]; // 0x2f0
    int dynamics_num;                      // 0x3E0
    struct script                          //  0x3E4
    {                                      //
        float script_event_timer;          // 0x3E4
        float script_frame_timer;          // 0x3E8
        int *script_current;               // 0x3EC
        int script_loop_num;               // 0x3F0
        int *script_return;                // 0x3F4
    } script;                              //
    int unk;                               // 0x3F8
    int unk3FC;                            // 0x3FC
    int pointer_to_0x460;                  // 0x400
    int pointer_to_0x3c0;                  // 0x404
    ColorOverlay color[3];                 // 0x408
    LOBJ *LObj;                            // 0x588
    int anim_num;                          // 0x58C
    Figatree *figatree_curr;               // 0x590, pointer to the FtAnim struct
    struct                                 // 0x594
    {
        u32 transn_phys_update : 1;       // 0x80000000, gives fighter speed based on transN offset
        u32 loop_anim : 1;                // 0x40000000, loops animation
        u32 x20000000 : 1;                // 0x20000000
        u32 x10000000 : 1;                // 0x10000000
        u32 no_dynamics : 1;              // 0x08000000
        u32 x04000000 : 1;                // 0x04000000
        u32 transn_use_model_scale : 1;   // 0x02000000
        u32 x01c00000 : 3;                // 0x01C00000
        u32 x003ffe00 : 13;               // 0x003ffe00
        u32 disable_blend_bone_index : 4; // 0x000001e0
        u32 kind : 5;                     // 0x0000001f, ft kind, used in vanilla melee to determine thrown boneset or ft boneset
    } action_flags;
    void *anim_requested;                     // 0x598
    void *anim_cache_curr;                    // 0x59C
    void *anim_cache_persist;                 // 0x5A0
    void *anim_curr_ARAM;                     // 0x5A4
    void *anim_persist_ARAM;                  // 0x5A8
    int dobj_toggle_num;                      // 0x5AC
    int x5B0;                                 // 0x5B0
    int x5B4;                                 // 0x5B4
    int x5B8;                                 // 0x5B8
    int x5BC;                                 // 0x5BC
    int x5C0;                                 // 0x5C0
    int x5C4;                                 // 0x5C4
    int x5C8;                                 // 0x5C8
    int texanim_num;                          // 0x5CC, number of texture anims this fighter has
    int x5D0;                                 // 0x5D0
    int x5D4;                                 // 0x5D4
    int x5D8;                                 // 0x5D8
    int x5DC;                                 // 0x5DC
    int x5E0;                                 // 0x5E0
    int x5E4;                                 // 0x5E4
    FighterBone *bones;                       // 0x5E8
    int bone_num;                             // 0x5EC
    DOBJ **dobj_lookup;                       // 0x5F0
    FtVis dobj_toggle[12];                    // 0x5f4
    Effect *gfx;                              // 0x60C
    int x610;                                 // 0x610
    int x614;                                 // 0x614
    char pad_index;                           // 0x618
    char costume_id;                          // 0x619
    char color_overlay_id;                    // 0x61A
    u8 team;                                  // 0x61B
    char x61e;                                // 0x61E
    char x61F;                                // 0x61F
    struct input                              // input data
    {                                         //
        Vec2 lstick;                          // 0x620
        Vec2 lstick_prev;                     // 0x628
        int x630;                             // 0x630
        int x634;                             // 0x634
        Vec2 cstick;                          // 0x638
        int x640;                             // 0x640
        int x644;                             // 0x644
        int x648;                             // 0x648
        int x64C;                             // 0x64C
        float trigger;                        // 0x650
        int x654;                             // 0x654
        int x658;                             // 0x658
        int held;                             // 0x65C
        int held_prev;                        // 0x660
        int x664;                             // 0x664
        int down;                             // 0x668
        int x66C;                             // 0x66C
        char timer_lstick_tilt_x;             // 0x670
        char timer_lstick_tilt_y;             // 0x671
        char timer_trigger_analog;            // 0x672
        char timer_lstick_smash_x;            // 0x673
        char timer_lstick_smash_y;            // 0x674
        char timer_trigger_digital;           // 0x675
        char timer_lstick_any_x;              // 0x676
        char timer_lstick_any_y;              // 0x677
        char timer_trigger_any;               // 0x678
        char x679;                            // 0x679
        char x67A;                            // 0x67A
        char x67B;                            // 0x67B
        char timer_a;                         // 0x67C
        char timer_b;                         // 0x67D
        char timer_xy;                        // 0x67E
        char timer_trigger_any_ignore_hitlag; // 0x67F
        char timer_LR;                        // 0x680
        char timer_padup;                     // 0x681
        char timer_paddown;                   // 0x682
        char timer_item_release;              // 0x683
        char since_rapid_lr;                  // 0x684
        char timer_jump;                      // 0x685
        char timer_specialhi;                 // 0x686
        char timer_speciallw;                 // 0x687
        char timer_specials;                  // 0x688
        char timer_specialn;                  // 0x689
        char timer_jump_lockout;              // 0x68A
        char timer_specialhi_lockout;         // 0x68B
    } input;                                  //
    Vec3 transN_pos;                          // x68c
    Vec3 transN_pos_prev;                     // 0x698
    Vec3 transN_offset;                       // 0x6A4
    Vec3 transN_offset_prev;                  // 0x6B0
    float input_stickangle;                   // 0x6BC
    int x6C0;                                 // 0x6C0
    int x6C4;                                 // 0x6C4
    int x6C8;                                 // 0x6C8
    int x6CC;                                 // 0x6CC
    int x6D0;                                 // 0x6D0
    int x6D4;                                 // 0x6D4
    int x6D8;                                 // 0x6D8
    int x6DC;                                 // 0x6DC
    int x6E0;                                 // 0x6E0
    int x6E4;                                 // 0x6E4
    int x6E8;                                 // 0x6E8
    int x6EC;                                 // 0x6EC
    CollData coll_data;                       // 0x6F0 -> 0x88C
    CmSubject *camera_subject;                // 0x890
    struct state
    {
        float frame;         // 0x894, current frame of the animation
        int x898;            // 0x898
        float rate;          // 0x89C, current speed rate of the animation
        int x8a0;            // 0x8a0
        float blend;         // 0x8a4, current interpolation value of the animation
        float current_blend; // 0x8a8
    } state;
    JOBJ *anim_skeleton;               // 0x8ac
    int x8b0;                          // 0x8b0
    int x8b4;                          // 0x8b4
    int x8b8;                          // 0x8b8
    int x8bc;                          // 0x8bc
    int curr_hold_anim;                // 0x8c0
    int x8c4;                          // 0x8c4
    int x8c8;                          // 0x8c8
    int x8cc;                          // 0x8cc
    int x8d0;                          // 0x8d0
    int x8d4;                          // 0x8d4
    int x8d8;                          // 0x8d8
    int x8dc;                          // 0x8dc
    int x8e0;                          // 0x8e0
    int x8e4;                          // 0x8e4
    int x8e8;                          // 0x8e8
    int x8ec;                          // 0x8ec
    int x8f0;                          // 0x8f0
    int x8f4;                          // 0x8f4
    int x8f8;                          // 0x8f8
    int x8fc;                          // 0x8fc
    int x900;                          // 0x900
    int x904;                          // 0x904
    int x908;                          // 0x908
    int x90c;                          // 0x90c
    int x910;                          // 0x910
    ftHit hitbox[4];                   // 0x914
    ftHit throw_hitbox[2];             // 0xdf4,
    ftHit thrown_hitbox;               // 0x1064
    u8 team_unk;                       // 0x119c, friendly fire related
    u8 grabber_ply;                    // 0x119D, slot ID of the person grabbing this fighter
    u8 hurt_num;                       // 0x119E, number of hurtboxes
    FtHurt hurtbox[15];                // 0x11A0
    FtCoin coinbox[2];                 // 0x1614
    int dynamics_hit_num;              // 0x166c
    DynamicHit dynamics_hit[11];       // 0x1670
    float x1828;                       // 0x1828
    struct dmg                         // 0x182c
    {                                  //
        int behavior;                  // 0x182c
        float percent;                 // 0x1830
        int x1834;                     // 0x1834
        float percent_temp;            // 0x1838
        int applied;                   // 0x183c
        int x1840;                     // 0x1840
        FtDmgLog hit_log;              // 0x1844, info regarding the last solid hit
        FtDmgLog tip_log;              // 0x1870, info regarding the last phantom hit
        float tip_hitlag;              // 0x189c, hitlag is stored here during phantom hits @ 8006d774
        float tip_force_applied;       // 0x18a0, used to check if a tip happened this frame
        float kb_mag;                  // 0x18a4  kb magnitude
        int x18a8;                     // 0x18a8
        int time_since_hit;            // 0x18ac   in frames
        float armor_unk;               // 0x18b0, is prioritized over the armor below
        float armor;                   // 0x18b4, used by yoshi double jump
        Vec2 vibrate_offset;           // 0x18b8
        int x18c0;                     // 0x18c0
        int source_ply;                // 0x18c4   damage source ply number
        int x18c8;                     // 0x18c8
        int x18cc;                     // 0x18cc
        int x18d0;                     // 0x18d0
        int x18d4;                     // 0x18d4
        int x18d8;                     // 0x18d8
        int x18dc;                     // 0x18dc
        int x18e0;                     // 0x18e0
        int x18e4;                     // 0x18e4
        int x18e8;                     // 0x18e8
        u16 atk_instance_hurtby;       // 0x18ec. Last Attack Instance This Player Was Hit by,
        int x18f0;                     // 0x18f0
        int x18f4;                     // 0x18f4
        u8 vibrate_index;              // 0x18f8, which dmg vibration values to use
        u8 x18f9;                      // 0x18f9
        u16 vibrate_timer;             // 0x18fa
        u8 vibrate_index_cur;          // 0x18fc, index of the current offset
        u8 vibrate_offset_num;         // 0x18fd, number of different offsets for this dmg vibration index
        Vec2 ground_slope;             // 0x1900
        int x1908;                     // 0x1908
        void *random_sfx_table;        // 0x190c, contains a ptr to an sfx table when requesting a random sfx
        int x1910;                     // 0x1910
        int x1914;                     // 0x1914
        struct                         // aka clank
        {                              //
            int dmg_dealt;             // 0x1918,
            float dmg_based_rate_mult; // 0x191c, updated @ 80077aec (when hitting projectile). is equal to 3 + (damageDealt * 0.3)
            float dir;                 // 0x1920, direction the rebound/clank occured in
        } rebound;                     //
        int x1924;                     // 0x1924
        int x1928;                     // 0x1928
        int x192c;                     // 0x192c
        struct                         // 0x1930
        {                              //
            Vec3 pos_prev;             // 0x1930
            Vec3 pos_cur;              // 0x193c
        } footstool;                   //
        int x1948;                     // 0x1948
        int x194c;                     // 0x194c
        int x1950;                     // 0x1950
        float x1954;                   // 0x1954,
        float hitlag_env_frames;       // 0x1958, Environment Hitlag Counter (used for peachs castle switches)
        float hitlag_frames;           // 0x195c
        float vibrate_mult;            // 0x1960
        float x1964;                   // 0x1964
    } dmg;                             //
    struct jump                        // 0x1968
    {                                  //
        char jumps_used;               // 0x1968
        char walljumps_used;           // 0x1969
    } jump;                            //
    float hitlag_mult;                 // 0x196c
    int x1970;                         // 0x1970
    GOBJ *item_held;                   // 0x1974
    GOBJ *x1978;                       // 0x1978
    int x197c;                         // 0x197c
    GOBJ *item_head;                   // 0x1980
    GOBJ *item_held_spec;              // 0x1984, special held item
    struct hurt                        // 0x1988
    {                                  //
        int kind_script;               // 0x1988, hurtkind set by action script
        int kind_game;                 // 0x198c, hurtkind set directly by game code (respawn, ledge, etc)
        struct                         //
        {                              //
            int ledge;                 // 0x1990
            int respawn;               // 0x1994
        } intang_frames;               // amount of intangibility frames remaining
    } hurt;                            //
    struct shield                      // melee only logs the highest damage dealing shield attack for that frame
    {
        float health;          // 0x1998
        float lightshield_amt; // 0x199c
        int dmg_taken;         // 0x19a0, seems to be all damage taken during the frame, is reset at the end of the frame
        int dmg_taken2;        // 0x19a4, idk there so many of these
        GOBJ *dmg_source;      // 0x19a8, points to the entity that hit the shield
        float hit_direction;   // 0x19ac
        int hit_attr;          // 0x19b0, attribute of the hitbox that collided
        float x19b4;           // 0x19b4
        float x19b8;           // 0x19b8
        int dmg_taken3;        // 0x19bc, seems to be the most recent amount of damage taken
    } shield;
    struct shield_bubble // 0x19c0
    {
        JOBJ *bone;                   // 0x19c0
        unsigned char is_checked : 1; // 0x19d0 0x80. is checked for collision when 0
        Vec3 pos;                     // 19d4
        Vec3 offset;                  // 0x19d4
        float size_mult;              // 0x19e0
    } shield_bubble;
    struct reflect_bubble // 0x19e4
    {
        JOBJ *bone;                   // 0x19e4
        unsigned char is_checked : 1; // 0x19d0 0x80. is checked for collision when 0
        Vec3 pos;                     // 0x19d4
        Vec3 offset;                  // 0x19f8
        float size_mult;              // 0x1a04
    } reflect_bubble;
    struct absorb_bubble // 0x1a08
    {
        JOBJ *bone;                   // 0x1a08
        unsigned char is_checked : 1; // 0x1a0c 0x80. is checked for collision when 0
        Vec3 pos;                     // 0x1a10
        Vec3 offset;                  // 0x1a1c
        float size_mult;              // 0x1a28
    } absorb_bubble;
    struct reflect_hit                    // 0x1a2c
    {                                     //
        float hit_direction;              // 0x1a2c
        int max_dmg;                      // 0x1a30
        float dmg_mult;                   // 0x1a34
        int is_break;                     // 0x1a38
    } reflect_hit;                        //
    struct absorb_hit                     // 0x1a40
    {                                     //
        int x1a3c;                        // 0x1a3c
        float hit_direction;              // 0x1a40
        int dmg_taken;                    // 0x1a44
        int hits_taken;                   // 0x1a48
    } absorb_hit;                         //
    struct                                // 0x1a4c
    {                                     //
        float grab_timer;                 // 0x1a4c
        int x1a50;                        // 0x1a50
        int x1a54;                        // 0x1a54
        GOBJ *attacker;                   // 0x1a58
        GOBJ *victim;                     // 0x1a5c
        GOBJ *item;                       // 0x1a60
        int x1a64;                        // 0x1a64
        u16 x1a68;                        // 0x1a68
        u16 vuln;                         // 0x1a6a
        int x1a6c;                        // 0x1a6c
        int x1a70;                        // 0x1a70
        Vec2 release_pos;                 // 0x1a74, this is determined when instantiating the player, its actually the offset of XRotN from TopN (800690d0)
        int x1a7c;                        // 0x1a7c
        int x1a80;                        // 0x1a80
        int x1a84;                        // 0x1a84
    } grab;                               //
    CPU cpu;                              // 0x1a88
    int x2004;                            // 0x2004
    int x2008;                            // 0x2008
    int x200c;                            // 0x200c
    int x2010;                            // 0x2010
    int x2014;                            // 0x2014
    int x2018;                            // 0x2018
    int x201c;                            // 0x201c
    int x2020;                            // 0x2020
    int x2024;                            // 0x2024
    int x2028;                            // 0x2028
    int x202c;                            // 0x202c
    int x2030;                            // 0x2030
    int x2034;                            // 0x2034
    int x2038;                            // 0x2038
    int x203c;                            // 0x203c
    int x2040;                            // 0x2040
    int x2044;                            // 0x2044
    int x2048;                            // 0x2048
    int x204c;                            // 0x204c
    int x2050;                            // 0x2050
    int x2054;                            // 0x2054
    int x2058;                            // 0x2058
    int x205c;                            // 0x205c
    int x2060;                            // 0x2060
    int ledge_cooldown;                   // 0x2064
    int atk_kind;                         // 0x2068, non attacks have id 1
    int x206c;                            // 0x206c
    u8 x2070;                             // 0x2070
    u8 state_kind : 4;                    // 0x2071, 0xf0
    u8 x2071_x0f : 4;                     // 0x2071, 0x0f
    u8 x2072;                             // 0x2072
    u8 x2073;                             // 0x2073
    int x2074;                            // 0x2074, marth's multi hit side b sets this to his percent. this is the start of some struct... present in items as well @ 0xd94
    int x2078;                            // 0x2078
    int x207c;                            // 0x207c
    int x2080;                            // 0x2080
    int x2084;                            // 0x2084
    u16 atk_instance;                     // 0x2088, Contains an ID unique to the current move instance. e.g, if two dairs are done back to back, this ID will differ to tell them apart from each other. It is stored to 0x18EC of the victim upon colliding with someone.
    int x208c;                            // 0x208c
    int x2090;                            // 0x2090
    GOBJ *victim;                         // 0x2094
    u16 x2098;                            // 0x2098
    u16 is_hide_player_indicator;         // 0x209a
    int x209c;                            // 0x209c
    JOBJ *accessory;                      // 0x20a0
    int x20a4;                            // 0x20a4
    void *shadow;                         // 0x20a8, ASSERTS @ 8037f7b8, describes multiple struct members
    int x20ac;                            // 0x20ac
    struct afterimage                     //
    {                                     //
        struct FtAfterImageKey key[3];    // 0x20b0
        float afterimage_bottom;          // 0x20f8
        float afterimage_top;             // 0x20fc
        u8 afterimage_state;              // 0x2100
        unsigned char afterimage_num : 7; // 0x2101
    } afterimage;                         //
    int x2104;                            // 0x2104
    int x2108;                            // 0x2108
    struct                                // 0x210c
    {                                     //
        s8 timer;                         // 0x210c, Set to 0 when contact with a wall (other conditions necessary)
        float direction;                  // 0x2110
    } wall;                               //
    struct smash                          // 0x2114
    {                                     //
        int state;                        // 0x2114 0 = none, 1 = pre-charge, 2 = charging, 3 = release
        int frame;                        // 0x2118 number of frames fighter has charged for
        float hold_frame;                 // 0x211c frame that charge begins/ends
        float dmg_mult;                   // 0x2120 damage multiplier
        float speed_mult;                 // 0x2124 speed multiplier?
        int x2128;                        // 0x2128
        int x212c;                        // 0x212c
        int is_sfx_played;                // 0x2130 bool for smash sfx?
        u8 vibrate_frame;                 // 0x2134
        u8 x22135;                        // 0x2135
        float since_hitbox;               // 0x2138
    } smash;                              //
    int x213c;                            // 0x213c
    int x2140;                            // 0x2140
    int x2144;                            // 0x2144
    int x2148;                            // 0x2148
    int x214c;                            // 0x214c
    int x2150;                            // 0x2150
    int x2154;                            // 0x2154
    int x2158;                            // 0x2158
    int x215c;                            // 0x215c
    int x2160;                            // 0x2160
    int x2164;                            // 0x2164
    int x2168;                            // 0x2168
    int x216c;                            // 0x216c
    int x2170;                            // 0x2170
    Vec3 thrown_origin;                   // 0x2174, offset of child from parent, used for placing the child when the grab breaks
    int x2180;                            // 0x2180
    int x2184;                            // 0x2184
    int screen_pixel_x;                   // 0x2188, current pixel the fighter occupies on screen
    int screen_pixel_y;                   // 0x218c, current pixel the fighter occupies on screen
    struct cb
    {
        void (*OnGrabFighter_Self)(GOBJ *fighter);              // 0x2190
        void (*x2194)(GOBJ *fighter);                           // 0x2194, i think this is on grabbed items
        void (*OnGrabFighter_Victim)(GOBJ *victim, GOBJ *self); // 0x2198
        void (*IASA)(GOBJ *fighter);                            // 0x219C
        void (*Anim)(GOBJ *fighter);                            // 0x21A0
        void (*Phys)(GOBJ *fighter);                            // 0x21a4
        void (*Coll)(GOBJ *fighter);                            // 0x21a8
        void (*Cam)(GOBJ *fighter);                             // 0x21ac
        void (*Accessory1)(GOBJ *fighter);                      // 0x21b0
        void (*Accessory_Persist)(GOBJ *fighter);               // 0x21b4, persists across states while the fighter is alive, death clears this ptr, so re-init on Respawn cb. phys position is copied to tonp and fighter jobj matrices are updated after this cb runs
        void (*Accessory_Freeze)(GOBJ *fighter);                // 0x21b8, only runs during hitlag
        void (*Accessory4)(GOBJ *fighter);                      // 0x21bc
        void (*OnGiveDamage)(GOBJ *fighter);                    // 0x21c0
        void (*OnShieldHit)(GOBJ *fighter);                     // 0x21c4
        void (*OnReflectHit)(GOBJ *fighter);                    // 0x21c8
        void (*x21cc)(GOBJ *fighter);                           // 0x21cc
        void (*EveryHitlag)(GOBJ *fighter);                     // 0x21d0
        void (*EnterHitlag)(GOBJ *fighter);                     // 0x21d4
        void (*ExitHitlag)(GOBJ *fighter);                      // 0x21d8
        void (*OnTakeDamage)(GOBJ *fighter);                    // 0x21dc
        void (*OnDeath_Persist)(GOBJ *fighter);                 // 0x21e0
        void (*OnDeath_State)(GOBJ *fighter);                   // 0x21e4, internally Dead_Proc as evidenced by 800f5430
        void (*OnDeath3)(GOBJ *fighter);                        // 0x21e8
        void (*OnStateChange)(GOBJ *fighter);                   // 0x21ec
        void (*OnTakeDamage2)(GOBJ *fighter);                   // 0x21f0
        void (*OnHurtboxDetect)(GOBJ *fighter);                 // 0x21f4
        void (*OnSpin)(GOBJ *fighter);                          // 0x21f8
    } cb;
    unsigned char x21fc_1 : 1;            // 0x80 - x21fc_
    unsigned char show_center_sphere : 1; // 0x40 - x21fc_
    unsigned char show_item_pickup : 1;   // 0x20 - x21fc_
    unsigned char show_cpu_ai : 1;        // 0x10 - x21fc_
    unsigned char show_footstool : 1;     // 0x8 - x21fc_
    unsigned char show_dynamics : 1;      // 0x4 - x21fc_
    unsigned char show_hit : 1;           // 0x2 - x21fc_
    unsigned char show_model : 1;         // 0x1 - x21fc_
    struct ftcmd_var                      // 0x2200
    {                                     //
        int flag0;                        // 0x2200
        int flag1;                        // 0x2204
        int flag2;                        // 0x2208
        int flag3;                        // 0x220C
    } ftcmd_var;                          //
    struct flags                          // 0x2210
    {                                     //
        unsigned char throw_1 : 1;        // 0x80 - x2210
        unsigned char throw_2 : 1;        // 0x40 - x2210
        unsigned char throw_3 : 1;        // 0x20 - x2210
        unsigned char throw_release : 1;  // 0x10 - x2210. also used to change users direction during aerial attacks
        unsigned char throw_turn : 1;     // 0x8 - x2210
        unsigned char throw_6 : 1;        // 0x4 - x2210
        unsigned char throw_7 : 1;        // 0x2 - x2210
        unsigned char throw_8 : 1;        // 0x1 - x2210
        char x2211;                       // x2211
        char x2212;                       // x2212
        char x2213;                       // x2213
        // float throw_timerval;                    // 0x2214 - equal to script_event_timer of the attacker
        char x2214;                                    // x2214
        char x2215;                                    // x2215
        unsigned char x2216_x80 : 1;                   // 0x80 - x2216
        unsigned char x2216_x40 : 1;                   // 0x40 - x2216
        unsigned char is_throwing : 1;                 // 0x20 - x2216
        unsigned char x2216_x10 : 1;                   // 0x10 - x2216. also used to change users direction during aerial attacks
        unsigned char x2216_x08 : 1;                   // 0x8 - x2216
        unsigned char x2216_x04 : 1;                   // 0x4 - x2216
        unsigned char x2216_x02 : 1;                   // 0x2 - x2216
        unsigned char x2216_x01 : 1;                   // 0x1 - x2216
        char x2217;                                    // x2217
        unsigned char x2218_1 : 1;                     // 0x80 - x2218
        unsigned char x2218_2 : 1;                     // 0x40 - x2218
        unsigned char has_rapid_jab : 1;               // 0x20 - x2218
        unsigned char reflect_enable : 1;              // 0x10 - x2218
        unsigned char reflect_nochangeowner : 1;       // 0x8 - x2218
        unsigned char x2218_6 : 1;                     // 0x4 - x2218
        unsigned char absorb_enable : 1;               // 0x2 - x2218
        unsigned char absorb_unk : 1;                  // 0x1 - x2218
        unsigned char persistent_gfx : 1;              // 0x80 is shielding bool. 0x80 - 0x2219
        unsigned char immune : 1;                      // 0x40 - 0x2219, will skip all hit collision logic when raised (8006cbbc)
        unsigned char is_ignore_death : 1;             // 0x20 - 0x2219
        unsigned char hitbox_active : 1;               // 0x10 - 0x2219
        unsigned char x2219_5 : 1;                     // 0x8 - 0x2219
        unsigned char freeze : 1;                      // 0x4 - 0x2219
        unsigned char hitlag_unk : 1;                  // 0x2 - 0x2219
        unsigned char hitlag_unk2 : 1;                 // 0x1 - 0x2219
        unsigned char x221a_1 : 1;                     // 0x80 - 0x221a
        unsigned char x221a_2 : 1;                     // 0x40 - 0x221a
        unsigned char hitlag : 1;                      // 0x20 - 0x221a
        unsigned char hitlag_victim : 1;               // 0x10 - 0x221a
        unsigned char is_fastfall : 1;                 // 0x8 - 0x221a
        unsigned char no_hurt_script : 1;              // 0x4 - 0x221a
        unsigned char x221a_7 : 1;                     // 0x2 - 0x221a
        unsigned char gfx_persist : 1;                 // 0x1 - 0x221a
        unsigned char shield_enable : 1;               // 0x80 - 0x221b
        unsigned char shield_x40 : 1;                  // 0x40 - 0x221b
        unsigned char shield_x20 : 1;                  // 0x20 - 0x221b
        unsigned char shield_x10 : 1;                  // 0x10 - 0x221b
        unsigned char shield_x8 : 1;                   //  0x8 - 0x221b
        unsigned char x221b_grab : 1;                  // 0x4 - 0x221b, is checked at 80079304, skips some logic
        unsigned char x221b_7 : 1;                     // 0x2 - 0x221b
        unsigned char attacker_attached_to_victim : 1; // 0x1 - 0x221b, used for determining which player the anchor is during throw release
        unsigned char hit_by_grabber : 1;              // 0x80 - 0x221c, is enabled when grab victim is being hit by its grabbers hitbox, signals no damage state for this frame (still grabbed) (set @ 8007a6ec, checked @ 8008edfc)
        unsigned char x221c_2 : 1;                     // 0x40 - 0x221c
        unsigned char is_powershield : 1;              // 0x20 - 0x221c
        unsigned char x221c_4 : 1;                     // 0x10 - 0x221c
        unsigned char x221c_5 : 1;                     // 0x8 - 0x221c
        unsigned char x221c_6 : 1;                     // 0x4 - 0x221c
        unsigned char hitstun : 1;                     // 0x2 - 0x221c
        unsigned char ik_orientation : 1;              // 0x1 = 0x221c
        unsigned char ik_rfoot : 1;                    // 0x80 - 0x221d
        unsigned char ik_lfoot : 1;                    // 0x40 - 0x221d
        unsigned char ftvis_reqrevert : 1;             // 0x20 - 0x221d, request all ftvis revert to default next state change
        unsigned char input_update_history : 1;        // 0x10 - 0x221d, will update input history
        unsigned char input_disable : 1;               // 0x8 - 0x221d, disables new inputs from being read
        unsigned char nudge_disable : 1;               // 0x4 - 0x221d
        unsigned char ground_ignore : 1;               // 0x2 - 0x221d
        unsigned char x221d_8 : 1;                     // 0x1 - 0x221d
        unsigned char invisible : 1;                   // 0x80 - 0x221e
        unsigned char x221e_2 : 1;                     // 0x40 - 0x221e
        unsigned char x221e_3 : 1;                     // 0x20 - 0x221e
        unsigned char item_visible : 1;                // 0x10 - 0x221e
        unsigned char item_head_visible : 1;           // 0x8 - 0x221e, head items are visible when this is enabled
        unsigned char invisible_script : 1;            // 0x4 - 0x221e
        unsigned char x221e_7 : 1;                     // 0x2 - 0x221e
        unsigned char x221e_8 : 1;                     // 0x1 - 0x221e
        unsigned char is_offscreen : 1;                // 0x80 - 0x221f
        unsigned char dead : 1;                        // 0x40 - 0x221f
        unsigned char x221f_3 : 1;                     // 0x20 - 0x221f, hides player indicator
        unsigned char sleep : 1;                       // 0x10 - 0x221f
        unsigned char ms : 1;                          // 0x08 - 0x221f, ms = master/slave. is 1 when the player is a slave
        unsigned char x221f_6 : 1;
        unsigned char x221f_7 : 1;
        unsigned char x221f_8 : 1;
        char can_input_multijump;                 // 0x2220
        char flags_2221;                          // 0x2221
        unsigned char x2222_1 : 1;                // 0x80 - 0x2222
        unsigned char is_multijump : 1;           // 0x40 - 0x2222
        unsigned char x2222_grab : 1;             // 0x20 - 0x2222
        unsigned char ceilko_nokb : 1;            // 0x10 - 0x2222, allow death off top without any Y KB
        unsigned char x2222_5 : 1;                // 0x08 - 0x2222
        unsigned char has_follower : 1;           // 0x04 - 0x2222, this makes the subcharacter enter sleep when the main char dies
        unsigned char x2222_skip_phys_update : 1; // 0x02 - 0x2222
        unsigned char x2222_8 : 1;                // 0x01 - 0x2222
        unsigned char x2223_1 : 1;                // 0x80 - 0x2223
        unsigned char x2223_2 : 1;                // 0x40 - 0x2223
        unsigned char x2223_3 : 1;                // 0x20 - 0x2223
        unsigned char x2223_4 : 1;                // 0x10 - 0x2223
        unsigned char x2223_5 : 1;                // 0x8 - 0x2223
        unsigned char x2223_6 : 1;                // 0x4 - 0x2223, footstool related? checked @ 800808dc
        unsigned char x2223_7 : 1;                // 0x2 - 0x2223
        unsigned char x2223_8 : 1;                // 0x1 - 0x2223, related to armor @ 8008d9f8
        unsigned char x2224_1 : 1;                // 0x80 - 0x2224
        unsigned char x2224_2 : 1;                // 0x40 - 0x2224
        unsigned char stamina_dead : 1;           // 0x20 - 0x2224
        unsigned char x2224_4 : 1;                // 0x10 - 0x2224
        unsigned char x2224_5 : 1;                // 0x8 - 0x2224
        unsigned char x2224_6 : 1;                // 0x4 - 0x2224
        unsigned char x2224_7 : 1;                // 0x2 - 0x2224
        unsigned char can_walljump : 1;           // 0x1 - 0x2224
        unsigned char x2225_1 : 1;                // 0x80 - 0x2225
        unsigned char x2225_2 : 1;                // 0x40 - 0x2225
        unsigned char has_model_addition : 1;     // 0x20 - 0x2225  bool for if fighter has a model addition, like kirby copy ability and puff hat
        unsigned char x2225_4 : 1;                // 0x10 - 0x2225
        unsigned char x2225_5 : 1;                // 0x8 - 0x2225
        unsigned char x2225_6 : 1;                // 0x4 - 0x2225
        unsigned char is_mute_voice : 1;          // 0x2 - 0x2225
        unsigned char is_stamina : 1;             // 0x1 - 0x2225
        unsigned char x2226_1 : 1;                // 0x80 - 0x2226
        unsigned char x2226_2 : 1;                // 0x40 - 0x2226
        unsigned char is_robj_child : 1;          // 0x20 - 0x2226, might actually be for skipping grab collision
        unsigned char x2226_x10 : 1;              // 0x10 - 0x2226
        unsigned char cloak1 : 1;                 // 0x8 - 0x2226
        unsigned char cloak2 : 1;                 // 0x4 - 0x2226
        unsigned char x2226_7 : 1;                // 0x2 - 0x2226
        unsigned char x2226_8 : 1;                // 0x1 - 0x2226
        char flags_2227;                          // 0x2227
        char x2228_1 : 1;                         // 0x80 - 0x2228
        char x2228_2 : 1;                         // 0x40 - 0x2228
        char use_sandbag_logic : 1;               // 0x20 - 0x2228, only sandbag uses this! ignores death and forces missed tech @ 80097d58
        char x2228_4 : 1;                         // 0x10 - 0x2228
        char x2228_5 : 1;                         // 0x08 - 0x2228
        char is_ignore_death3 : 1;                // 0x04 - 0x2228
        char used_tether : 1;                     // 0x02 - 0x2228
        char x2228_8 : 1;                         // 0x01 - 0x2228
        unsigned char x2229_1 : 1;                // 0x80 - 0x2229
        unsigned char x2229_2 : 1;                // 0x40 - 0x2229
        unsigned char x2229_3 : 1;                // 0x20 - 0x2229
        unsigned char is_ignore_offscreen : 1;    // 0x10 - 0x2229
        unsigned char skip_coin_collcheck : 1;    // 0x8 - 0x2229, this is toggled every frame, checks half of the players every frame to save on cpu
        unsigned char x2229_6 : 1;                // 0x4 - 0x2229
        unsigned char x2229_7 : 1;                // 0x2 - 0x2229
        unsigned char no_reaction_always : 1;     // 0x1 - 0x2229
        unsigned char x222a_x80 : 1;              // 0x80 - 0x222a
        unsigned char is_ignore_death2 : 1;       // 0x40 - 0x222a
        unsigned char x222a_x20 : 1;              // 0x20 - 0x222a
        unsigned char x222a_x10 : 1;              // 0x10 - 0x222a
        unsigned char x222a_x08 : 1;              // 0x08 - 0x222a
        unsigned char x222a_x04 : 1;              // 0x04 - 0x222a
        unsigned char x222a_x02 : 1;              // 0x02 - 0x222a
        unsigned char x222a_x01 : 1;              // 0x01 - 0x222a
        char flags_222B;                          // 0x222B
    } flags;                                      //
    struct fighter_var                            // 0x222c
    {                                             //
        int ft_var1;                              // 0x222c
        int ft_var2;                              // 0x2230
        int ft_var3;                              // 0x2234
        int ft_var4;                              // 0x2238
        int ft_var5;                              // 0x223c
        int ft_var6;                              // 0x2240
        int ft_var7;                              // 0x2244
        int ft_var8;                              // 0x2248
        int ft_var9;                              // 0x224c
        int ft_var10;                             // 0x2250
        int ft_var11;                             // 0x2254
        int ft_var12;                             // 0x2258
        int ft_var13;                             // 0x225c
        int ft_var14;                             // 0x2260
        int ft_var15;                             // 0x2264
        int ft_var16;                             // 0x2268
        int ft_var17;                             // 0x226c
        int ft_var18;                             // 0x2270
        int ft_var19;                             // 0x2274
        int ft_var20;                             // 0x2278
        int ft_var21;                             // 0x227c
        int ft_var22;                             // 0x2280
        int ft_var23;                             // 0x2284
        int ft_var24;                             // 0x2288
        int ft_var25;                             // 0x228c
        int ft_var26;                             // 0x2290
        int ft_var27;                             // 0x2294
        int ft_var28;                             // 0x2298
        int ft_var29;                             // 0x229c
        int ft_var30;                             // 0x22a0
        int ft_var31;                             // 0x22a4
        int ft_var32;                             // 0x22a8
        int ft_var33;                             // 0x22ac
        int ft_var34;                             // 0x22b0
        int ft_var35;                             // 0x22b4
        int ft_var36;                             // 0x22b8
        int ft_var37;                             // 0x22bc
        int ft_var38;                             // 0x22c0
        int ft_var39;                             // 0x22c4
        int ft_var40;                             // 0x22c8
        int ft_var41;                             // 0x22cc
        int ft_var42;                             // 0x22d0
        int ft_var43;                             // 0x22d4
        int ft_var44;                             // 0x22d8
        int ft_var45;                             // 0x22dc
        int ft_var46;                             // 0x22e0
        int ft_var47;                             // 0x22e4
        int ft_var48;                             // 0x22e8
        int ft_var49;                             // 0x22ec
        int ft_var50;                             // 0x22f0
        int ft_var51;                             // 0x22f4
        int ft_var52;                             // 0x22f8
    } fighter_var;
    int x22fc;                     // 0x22fc
    int x2300;                     // 0x2300
    int x2304;                     // 0x2304
    int x2308;                     // 0x2308
    int x230c;                     // 0x230c
    u16 x2310;                     // 0x2310
    u16 x2312;                     // 0x2312
    float x2314;                   // 0x2314
    float x2318;                   // 0x2318
    float x231c;                   // 0x231c
    int x2320;                     // 0x2320
    int stage_internal;            // 0x2324 so stupid, used for decrementing hazard immunity
    int line_damage_immunity;      // 0x2328, frames in which fighter is immune to line damage
    int ftchkdevice_immunity;      // 0x232c, frames in which fighter is immune to chkdevice damage (brinstar lava)
    int x2330;                     // 0x2330
    int x2334;                     // 0x2334
    int x2338;                     // 0x2338
    int x233c;                     // 0x233c
    struct state_var               // 0x2340
    {                              //
        int state_var1;            // 0x2340
        int state_var2;            // 0x2344
        int state_var3;            // 0x2348
        int state_var4;            // 0x234c
        int state_var5;            // 0x2350
        int state_var6;            // 0x2354
        int state_var7;            // 0x2358
        int state_var8;            // 0x235c
        int state_var9;            // 0x2360
        int state_var10;           // 0x2364
        int state_var11;           // 0x2368
        int state_var12;           // 0x236c
        int state_var13;           // 0x2370
        int state_var14;           // 0x2374
        int state_var15;           // 0x2378
        int state_var16;           // 0x237c
        int state_var17;           // 0x2380
        int state_var18;           // 0x2384
    } state_var;                   //
    int x2388;                     // 0x2388
    int x238c;                     // 0x238c
    int x2390;                     // 0x2390
    int x2394;                     // 0x2394
    int x2398;                     // 0x2398
    int x239c;                     // 0x239c
    int x23a0;                     // 0x23a0
    int x23a4;                     // 0x23a4
    int x23a8;                     // 0x23a8
    int x23ac;                     // 0x23ac
    int x23b0;                     // 0x23b0
    int x23b4;                     // 0x23b4
    int x23b8;                     // 0x23b8
    int x23bc;                     // 0x23bc
    int x23c0;                     // 0x23c0
    int x23c4;                     // 0x23c4
    int x23c8;                     // 0x23c8
    int x23cc;                     // 0x23cc
    int x23d0;                     // 0x23d0
    int x23d4;                     // 0x23d4
    int x23d8;                     // 0x23d8
    int x23dc;                     // 0x23dc
    int x23e0;                     // 0x23e0
    int x23e4;                     // 0x23e4
    int x23e8;                     // 0x23e8
    struct MEX                     // 0x23ec
    {                              //
        int anim_owner;            // 0x23ec
        u8 ucf_stick_x[3];         // 0x23f0
        void *costume;             // 0x23f4, pointer to mexCostume symbol
        int accessory_num;         // 0x23f8, number of mexCostume accessories active
        void **accessories;        // 0x23fc, pointer to mexCostume accessories
    } MEX;                         //
    struct TM                      // 0x2400
    {                              //
        s16 state_frame;           // 0x2400, how many frames the player has been in this state
        s16 state_frame_hitlag;    // 0x2402, how many frames the player has been in this state, counting hitlag
        s16 shield_frame;          // 0x2404, how many frames the player has been shielding
        u16 state_prev[6];         // 0x2406,
        u16 state_prev_frames[6];  // 0x240c,
        u16 last_move_hurt;        // 0x2410, Previous Move Instance Hit By
        u16 vuln_frames;           // 0x2412, how many frames the fighter has been vulnerable
        u16 can_fastfall_frames;   // how many frames the fighter has been able to fast fall
        int post_hitstun_frames;   // frames fighter has been out of hitstun
        GOBJ *fighter_hurt_shield; // pointer to the fighter who's shield this fighter hit
        void *cb_anim;             // additional animation callback
    } TM;
};

struct FtMultiJumpDesc // exists in fighters special attributes
{
    int turn_frames;                    // turn frame length
    float turn_stick_x_min;             // min x value on left stick to trigger aerial turn
    float vel_stick_x_mult;             // jump x velocity = left stick x * this
    float aerial_drift_stick_mult_mult; // 0xC, multipler for the value in the fighter attribute
    float aerial_drift_max_mult;        // 0x10, multipler for the value in the fighter attribute
    float jump_vel_y[5];                // 0x14 subsequemt jumps Y velocities
    int jump_num;                       // 0x28, number of total aerial jumps
    int jump_state_start;               // 0x2C, state index for first aerial jump
    int x30;                            // 0x30,
};

struct FtParts // is in the fighter data
{
    int num;     // 0x2240
    DOBJ **dobj; // 0x2244   array of dobjs for the ftpar
    void *x8;    // 0x2248
    void *xc;    // 0x224C
};

struct FtPartsDesc
{
    int model_num; // 0x2250
    FtPartsLookup *lookups;
};

struct FtPartsLookup
{
    FtParts *x0;
    void *x4;
    void *x8;
    void *xc;
    void *x10;
};

struct FtPartsVis // is in the fighter data
{
    int num;                           // 0x0
    u8 x4[5];                          // 0x4 array of bools?
    FtPartsVisLookup *highpoly_table;  // 0x0C
    FtPartsVisLookup *lowpoly_table;   // 0x10
    FtPartsVisLookup *metalpoly_table; // 0x14
    FtPartsVisLookup *metalmain_table; // 0x18
    FtPartsVisLookup *x1C;             // 0x1C
};

struct FtSymbolLookup
{
    FtSymbols *archives;
    u8 num;
};

struct FtSymbols
{
    JOBJ *joint;          // 0x0
    void *matanim_joint;  // 0x4
    void *x8;             // 0x8
    void *xc;             // 0xc
    void *x10;            // 0x10
    HSD_Archive *costume; // 0x14
};

struct FtDatNameLookup
{
    char *filename;
    char *symbol;
};
struct FtKindDesc // this is really CKindDesc...?
{
    s8 ft_main;           // main fighter ft_kind
    s8 ft_sub;            // sub fighter ft_kind, -1 if none
    s8 no_spawn_together; //
};

/** State Structs **/
struct FtCliffCatch
{
    int ledge_index;
    float fall_timer;
    int timer;
};
struct FtDamage
{
    float hitstun; // 0x2340
    int x2344;
    int x2348;
    int x234c;
    int x2350;
    float x2354;
    u8 x2358;
    u8 hit_env_kind;   // 0x2359, 0 = none, 1 = ground 2 = wall, 3 = ceiling
    u8 is_meteor;      // 0x235a
    u8 meteor_lockout; // 0x235b
};
struct FtLanding
{
    int can_interrupt; // 0x2340
};
struct FtDead
{
    int timer;
};

struct FtEntry
{
    int delay_frames;
};
/** Script Structs **/
struct FtScript
{
    unsigned opcode : 6;
    union
    {
        struct
        {
            unsigned frames : 26;
        } timer_sync; // 2
        struct
        {
            unsigned frame : 26;
        } timer_async; // 3
        struct
        {
            unsigned bone : 8;
            unsigned use_common_bone_id : 1;
            unsigned destroy_on_state_change : 1;
            unsigned unk1 : 16;
            unsigned id : 16;
            unsigned unk2 : 16;
            unsigned offset_z : 16;
            unsigned offset_y : 16;
            unsigned offset_x : 16;
            unsigned range_z : 16;
            unsigned range_y : 16;
            unsigned range_x : 16;
        } gfx; // 10
        struct
        {
            unsigned id : 3;
            unsigned hit_group : 3;
            unsigned only_hit_grabbed_fighter : 1;
